판다스_04 판다스 시리즈와 데이터프레임

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    {"a" : [4,5,6],
    "b" : [7,8,9],
    "c" : [10,11,12]},
    index = [1,2,3])

#list 형태의 데이터 : 판다스에서 series라 함 
#dictionary 형태로 저장

In [3]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [4]:
df[['a','b']]

   a  b
1  4  7
2  5  8
3  6  9

In [5]:
df.loc[2] #행 보기

a     5
b     8
c    11
Name: 2, dtype: int64

In [6]:
df.loc[3, "a"]

6

In [7]:
df.loc[[1,2], ['a','b']]

   a  b
1  4  7
2  5  8

In [8]:
df = pd.DataFrame(
    [[4,5,6],
    [7,8,9],
    [10,11,12]],
    index = [1,2,3],
    columns=['a','b','c'])
df

    a   b   c
1   4   5   6
2   7   8   9
3  10  11  12

In [9]:
import numpy as np 

df = pd.DataFrame(
    {"a" : [4,5,6,6,np.nan],
    "b" : [7,8,np.nan,9,9],
    "c" : [10,11,12,np.nan,12]},
    index = pd.MultiIndex.from_tuples(
        [('d',1), ('d',2),('e',2),('e',3),('e',4)],
        names = ['n', 'v']
    )
)
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

판다스_06 판다스 데이터프레임

In [10]:
#딕셔너리에서 시리즈로 변환 
import pandas as pd 

dict_data = {'a':1,'b':2,'c':3}

sr = pd.Series(dict_data)
print(type(sr))

print(sr)

<class 'pandas.core.series.Series'>
a    1
b    2
c    3
dtype: int64

In [11]:
import pandas as pd 
list_data = ['2023-05-09', 3.14, 'ABC',100,True]
sr = pd.Series(list_data)
print(sr)

0    2023-05-09
1          3.14
2           ABC
3           100
4          True
dtype: object

In [12]:
#인덱스 배열은 변수 idx에 저장, 데이터 값 배열된 변수 val에 저장 
idx = sr.index
val = sr.values
print(idx)
print(val)

RangeIndex(start=0, stop=5, step=1)
['2023-05-09' 3.14 'ABC' 100 True]

In [13]:
top_data = ['이하이','2023-05-06','여',True]
sr = pd.Series(top_data, index=['이름','생년월일','성별','학생여부'])
print(sr)

이름             이하이
생년월일    2023-05-06
성별               여
학생여부          True
dtype: object

In [14]:
print(sr[0])
print(sr['이름'])

이하이
이하이

C:\Users\Master\AppData\Local\Temp\ipykernel_5828\3752549667.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[0])

In [15]:
print(sr[[1,2]])
print(sr[['생년월일','성별']])

생년월일    2023-05-06
성별               여
dtype: object
생년월일    2023-05-06
성별               여
dtype: object

C:\Users\Master\AppData\Local\Temp\ipykernel_5828\680950689.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[[1,2]])

In [16]:
print(sr[1:2])
print(sr[['생년월일','성별']])

생년월일    2023-05-06
dtype: object
생년월일    2023-05-06
성별               여
dtype: object

판다스_07 subset observationRows

In [17]:
import pandas as pd 

import numpy as np 
df = pd.DataFrame(
    {'a':[4,5,6],
     'b':[7,8,9],
     'c':[10,11,12]},
     index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2)],
        names=['n','v']
     )
)

In [18]:
df[df>7]

      a    b   c
n v
d 1 NaN  NaN  10
  2 NaN  8.0  11
e 2 NaN  9.0  12

In [19]:
df[df.b>7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [20]:
df[df['c'] >7 ]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [21]:
import pandas as pd 

import numpy as np 
df_1 = pd.DataFrame(
    {'a':[4,5,6,6],
     'b':[7,8,9,9],
     'c':[10,11,12,12]},
     index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3)],
        names=['n','v']
     )
)

In [22]:
df_1.drop_duplicates() #중복값 제거

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [23]:
df_1 #원본은 그대로

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [24]:
df_1.drop_duplicates(inplace=True) #중복값 제거 
df_1

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [25]:
df_1.drop_duplicates(keep='last') #마지막 행에 있는 값을 사용 
df_1

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

판다스_08 logic 연산
Logic in Python(and pandas)

In [26]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [27]:
df['b'] != 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [28]:
df[df['b'] != 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [29]:
df['a'].isin([5])

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [30]:
pd.isnull(df) #null값 확인

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False  False  False

In [31]:
df_2 = pd.DataFrame(
    {"a" : [4,5,6,6,np.nan],
    "b" : [7,8,np.nan,9,9],
    "c" : [10,11,12,np.nan,12]},
    index = pd.MultiIndex.from_tuples(
        [('d',1), ('d',2),('e',2),('e',3),('e',4)],
        names = ['n', 'v']
    )
)

In [32]:
df_2

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [33]:
pd.isnull(df_2)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [34]:
df_2['a'].isnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [35]:
df_2['a'].isnull().sum()

1

In [36]:
pd.notnull(df_2).sum()

a    4
b    4
c    4
dtype: int64

In [37]:
df_2.any()

a    True
b    True
c    True
dtype: bool

In [38]:
~df_2.a.notnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

판다스_09 head, tail 데이터 미리보기

In [39]:
df_2.head(2)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [40]:
df_2.tail(2)

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [41]:
df_2.sample(frac=0.5) #일정 비율로 random하게 sampling

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [42]:
df_2.sample(frac=0.7)

       a    b     c
n v
d 2  5.0  8.0  11.0
e 4  NaN  9.0  12.0
  3  6.0  9.0   NaN
  2  6.0  NaN  12.0

In [43]:
df_2.sample(n=5)

       a    b     c
n v
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0
d 2  5.0  8.0  11.0
e 3  6.0  9.0   NaN
d 1  4.0  7.0  10.0

In [44]:
#비율로 샘플링 frac = 0.xx
#횟수, 개수 n = x

In [45]:
df_2.iloc[10:20]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [46]:
df_2.iloc[:2] # 0, 1

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [47]:
df_2.iloc[2:] #2,3,4

       a    b     c
n v
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [48]:
df_2.iloc[-2:-1]

       a    b   c
n v
e 3  6.0  9.0 NaN

In [49]:
df3 = pd.DataFrame({'a': [1,10,0,11,-1],
                    'b': list('abcde'),
                    'c' : [1.0,2.0,np.nan, 3.0,4.0]})

In [50]:
df3

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   0  c  NaN
3  11  d  3.0
4  -1  e  4.0

In [51]:
df3.nlargest(1,'a') #컬럼에서 가장 큰값 가져오기

    a  b    c
3  11  d  3.0

In [52]:
df3.nlargest(3,'c')

    a  b    c
4  -1  e  4.0
3  11  d  3.0
1  10  b  2.0

판다스 10 subset observationColumns

In [53]:
import pandas as pd 
import seaborn as sns

In [54]:
df = sns.load_dataset('iris')
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [55]:
columns = ['sepal_length','sepal_width','species']
df[columns]

     sepal_length  sepal_width    species
0             5.1          3.5     setosa
1             4.9          3.0     setosa
2             4.7          3.2     setosa
3             4.6          3.1     setosa
4             5.0          3.6     setosa
..            ...          ...        ...
145           6.7          3.0  virginica
146           6.3          2.5  virginica
147           6.5          3.0  virginica
148           6.2          3.4  virginica
149           5.9          3.0  virginica

[150 rows x 3 columns]

In [56]:
df[columns].head()

   sepal_length  sepal_width species
0           5.1          3.5  setosa
1           4.9          3.0  setosa
2           4.7          3.2  setosa
3           4.6          3.1  setosa
4           5.0          3.6  setosa

In [57]:
#정규표현식 

df.filter(regex='length') #length로 끝나는 컬럼명 불러오기

     sepal_length  petal_length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [58]:
df.loc[2:5,'sepal_width':'petal_width']

   sepal_width  petal_length  petal_width
2          3.2           1.3          0.2
3          3.1           1.5          0.2
4          3.6           1.4          0.2
5          3.9           1.7          0.4

In [59]:
df.iloc[:3,[1,3]]

   sepal_width  petal_width
0          3.5          0.2
1          3.0          0.2
2          3.2          0.2

In [60]:
df.loc[df['sepal_length'] > 5, ['sepal_length','sepal_width']]

     sepal_length  sepal_width
0             5.1          3.5
5             5.4          3.9
10            5.4          3.7
14            5.8          4.0
15            5.7          4.4
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[118 rows x 2 columns]

판다스 11 판다스로 기본통계하기

In [61]:
import pandas as pd 
import seaborn as sns
import numpy as np

In [62]:
df = sns.load_dataset('iris')
df.shape

(150, 5)

In [63]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [64]:
df['species'].value_counts() #범주형 데이터

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [65]:
df['petal_width'].value_counts() #숫자형 데이터

pd.DataFrame(df['petal_width'].value_counts()) #숫자형 데이터

             count
petal_width
0.2             29
1.3             13
1.8             12
1.5             12
1.4              8
2.3              8
1.0              7
0.4              7
0.3              7
2.1              6
2.0              6
0.1              5
1.2              5
1.9              5
1.6              4
2.5              3
2.2              3
2.4              3
1.1              3
1.7              2
0.6              1
0.5              1

In [66]:
print(len(df)) #행의 개수
print(df.shape[0]) #행만 가져오기
print(df.shape[1]) #열만 가져오기

150
150
5

In [67]:
len(df) == df.shape[0]

True

In [68]:
df['species'].nunique() # unique한 개수가 3개

3

In [69]:
df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [70]:
df.describe(include=[np.number])

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [71]:
df['petal_width'].median()

1.3

In [72]:
data = df.copy()

In [73]:
df = df.drop(columns='species')

In [74]:
df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [75]:
pd.DataFrame(df.mean())

                     0
sepal_length  5.843333
sepal_width   3.057333
petal_length  3.758000
petal_width   1.199333

In [76]:
df['petal_width'].quantile([0.25,0.75])

0.25    0.3
0.75    1.8
Name: petal_width, dtype: float64

In [77]:
df.min() #최소값
df.max() #최대값
df.var() #분산
df.std() #표준편차

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [78]:
df.corr() #상관관계

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

판다스_12 apply 함수

In [79]:
#apply() 
#시리즈 원소의 개수만큼 리턴 값을 받아서 같은 크기의 시리즈 객체로 반환함 

#lambda() 
#사용자 직접 만든 함수

In [80]:
data

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [81]:
data.apply(lambda x : x[1])

sepal_length       4.9
sepal_width        3.0
petal_length       1.4
petal_width        0.2
species         setosa
dtype: object

In [82]:
data['species'].apply(lambda x : x[0])

0      s
1      s
2      s
3      s
4      s
      ..
145    v
146    v
147    v
148    v
149    v
Name: species, Length: 150, dtype: object

In [83]:
data['species'].apply(lambda x : x[:3]) #species에서 3번째 글자까지 가지고 옴

0      set
1      set
2      set
3      set
4      set
      ...
145    vir
146    vir
147    vir
148    vir
149    vir
Name: species, Length: 150, dtype: object

In [84]:
data['species_3'] = data['species'].apply(lambda x : x[:3])

In [85]:
data

     sepal_length  sepal_width  petal_length  petal_width    species species_3
0             5.1          3.5           1.4          0.2     setosa       set
1             4.9          3.0           1.4          0.2     setosa       set
2             4.7          3.2           1.3          0.2     setosa       set
3             4.6          3.1           1.5          0.2     setosa       set
4             5.0          3.6           1.4          0.2     setosa       set
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica       vir
146           6.3          2.5           5.0          1.9  virginica       vir
147           6.5          3.0           5.2          2.0  virginica       vir
148           6.2          3.4           5.4          2.3  virginica       vir
149           5.9          3.0           5.1          1.8  virginica       vir

[150 rows x 6 columns]

In [86]:
def smp(x):
    x = x[-3:]
    return x

In [87]:
data['species_3'] = data['species'].apply(smp)

In [88]:
data

     sepal_length  sepal_width  petal_length  petal_width    species species_3
0             5.1          3.5           1.4          0.2     setosa       osa
1             4.9          3.0           1.4          0.2     setosa       osa
2             4.7          3.2           1.3          0.2     setosa       osa
3             4.6          3.1           1.5          0.2     setosa       osa
4             5.0          3.6           1.4          0.2     setosa       osa
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica       ica
146           6.3          2.5           5.0          1.9  virginica       ica
147           6.5          3.0           5.2          2.0  virginica       ica
148           6.2          3.4           5.4          2.3  virginica       ica
149           5.9          3.0           5.1          1.8  virginica       ica

[150 rows x 6 columns]

판다스_13 Dropna, Fillna, Isnull, Nothull

In [89]:
#dropna 
#na/null 값이 존재 시 제거(drop) 
#how = 'all', how = 'any'

#fillna()
#na/null 값을 대체 

#isnull() / notnull()
#결측치가 몇개인지 확인

In [90]:
#dropna()
df = pd.DataFrame([[np.nan, 2,np.nan,0], [3, 4, np.nan, 1],
                    [np.nan,np.nan,np.nan,5]],
                    columns = list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [91]:
df.dropna(axis=0, how= 'all') #axis=0 행에 모든 값이 nan일때 삭제 (모든값이 nan값이 없어서 기본 값출력)

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [92]:
df.dropna(axis=1, how= 'all') # axis=1 열에 모든 값이 nan일때 삭제

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5

In [93]:
df.dropna(axis=0, how= 'any') #행중 nan값이 존재한다면 삭제

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [94]:
df.dropna(axis=1, how= 'any')

   D
0  0
1  1
2  5

In [95]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [96]:
#fillna()
df.fillna(0) #nan값을 0으로 대체

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5

In [97]:
values = {'A' : 0, 'B' : 1, 'C' : 2 , 'D' : 3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [98]:
fillna_val = df['D'].max()
fillna_val

5

In [99]:
df.fillna(fillna_val)

     A    B    C  D
0  5.0  2.0  5.0  0
1  3.0  4.0  5.0  1
2  5.0  5.0  5.0  5

In [100]:
df.isnull()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False

In [101]:
df.isnull().sum() #결측치가 몇 개 인지 확인

A    2
B    1
C    3
D    0
dtype: int64

In [102]:
df.notnull().sum()

A    1
B    2
C    0
D    3
dtype: int64

판다스_14 Assisn으로 새로운 컬럼 만들기

In [103]:
#assign() 새로운 컬럼을 데이터프레임에 배정(assign)하는 함수

In [104]:
import pandas as pd 
import numpy as np 

df = pd.DataFrame({'A' : range(1, 11), 'B' : np.random.randn(10)})
df

    A         B
0   1  0.330348
1   2 -0.383361
2   3 -0.340424
3   4 -0.356922
4   5 -0.459694
5   6  0.341445
6   7  1.320329
7   8  1.062618
8   9 -0.429683
9  10 -0.136724

In [105]:
df.assign(In_A = lambda x : np.log(x.A))

    A         B      In_A
0   1  0.330348  0.000000
1   2 -0.383361  0.693147
2   3 -0.340424  1.098612
3   4 -0.356922  1.386294
4   5 -0.459694  1.609438
5   6  0.341445  1.791759
6   7  1.320329  1.945910
7   8  1.062618  2.079442
8   9 -0.429683  2.197225
9  10 -0.136724  2.302585

판다스_15 Qcut으로 범주화하기

In [ ]:
#quct()
#Bin Column을 n개의 Bucket으로 변화시킴 
#숫자형 데이터를 n개의 범주로 구분할 때 사용함 

#clip()
# 임계치 값을 지정해서 값을 변화시켜줄 때 사용함 

#abs() 절대값

In [106]:
df.A

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: A, dtype: int64

In [107]:
pd.qcut(df.A, 3, labels=['good','median','bad'])

0      good
1      good
2      good
3      good
4    median
5    median
6    median
7       bad
8       bad
9       bad
Name: A, dtype: category
Categories (3, object): ['good' < 'median' < 'bad']

In [108]:
pd.qcut(df.A, 2, labels=['good','bad'])

0    good
1    good
2    good
3    good
4    good
5     bad
6     bad
7     bad
8     bad
9     bad
Name: A, dtype: category
Categories (2, object): ['good' < 'bad']

In [111]:
print(df.max(axis=0)) #행에서 
print()
print(df.max(axis=1)) #열

A    10.000000
B     1.320329
dtype: float64

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [112]:
print(df.min(axis=0)) #행에서 
print()
print(df.min(axis=1)) #열

A    1.000000
B   -0.459694
dtype: float64

0    0.330348
1   -0.383361
2   -0.340424
3   -0.356922
4   -0.459694
5    0.341445
6    1.320329
7    1.062618
8   -0.429683
9   -0.136724
dtype: float64

In [116]:
df['A'].clip(lower= -10, upper= 10)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: A, dtype: int64

In [115]:
df['B'].clip(lower= 1, upper= 3)

0    1.000000
1    1.000000
2    1.000000
3    1.000000
4    1.000000
5    1.000000
6    1.320329
7    1.062618
8    1.000000
9    1.000000
Name: B, dtype: float64

In [117]:
df['B'].abs()

0    0.330348
1    0.383361
2    0.340424
3    0.356922
4    0.459694
5    0.341445
6    1.320329
7    1.062618
8    0.429683
9    0.136724
Name: B, dtype: float64

Reshaping Data (데이터 재형성)<br>
sort_values/df.rename/df.sort_index/df.reset_index

In [119]:
import pandas as pd
import seaborn as sns 

df = sns.load_dataset('mpg')
df.shape

(398, 9)

In [120]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [121]:
#특정 열의 데이터를 기준으로 데이터프레임을 정렬
df.sort_values

<bound method DataFrame.sort_values of       mpg  cylinders  displacement  horsepower  weight  acceleration  \
0    18.0          8         307.0       130.0    3504          12.0
1    15.0          8         350.0       165.0    3693          11.5
2    18.0          8         318.0       150.0    3436          11.0
3    16.0          8         304.0       150.0    3433          12.0
4    17.0          8         302.0       140.0    3449          10.5
..    ...        ...           ...         ...     ...           ...
393  27.0          4         140.0        86.0    2790          15.6
394  44.0          4          97.0        52.0    2130          24.6
395  32.0          4         135.0        84.0    2295          11.6
396  28.0          4         120.0        79.0    2625          18.6
397  31.0          4         119.0        82.0    2720          19.4

     model_year  origin                       name
0            70     usa  chevrolet chevelle malibu
1            70     usa          buick skylark 320
2            70     usa         plymouth satellite
3            70     usa              amc rebel sst
4            70     usa                ford torino
..          ...     ...                        ...
393          82     usa            ford mustang gl
394          82  europe                  vw pickup
395          82     usa              dodge rampage
396          82     usa                ford ranger
397          82     usa                 chevy s-10

[398 rows x 9 columns]>

In [122]:
df.sort_values('cylinders').head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
111,18.0,3,70.0,90.0,2124,13.5,73,japan,maxda rx3
71,19.0,3,70.0,97.0,2330,13.5,72,japan,mazda rx2 coupe
334,23.7,3,70.0,100.0,2420,12.5,80,japan,mazda rx-7 gs
243,21.5,3,80.0,110.0,2720,13.5,77,japan,mazda rx-4
267,27.5,4,134.0,95.0,2560,14.2,78,japan,toyota corona

In [123]:
df.sort_values('mpg',ascending=False).head() #내림차순

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
322,46.6,4,86.0,65.0,2110,17.9,80,japan,mazda glc
329,44.6,4,91.0,67.0,1850,13.8,80,japan,honda civic 1500 gl
325,44.3,4,90.0,48.0,2085,21.7,80,europe,vw rabbit c (diesel)
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
326,43.4,4,90.0,48.0,2335,23.7,80,europe,vw dasher (diesel)

In [124]:
#df.name 데이터프레임 내의 행,열의 이름을 변경 
df.rename(columns= {'model_year' : 'year'}).head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [125]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [127]:
df = df.rename(columns= {'model_year' : 'year'}).head()
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [129]:
#df.sort_index 
#index 별로 정렬 

df.sort_index().head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [130]:
#df.reset_index index가 없을 때, index를 생성해서 정렬 
df.reset_index

<bound method DataFrame.reset_index of     mpg  cylinders  displacement  horsepower  weight  acceleration  year  \
0  18.0          8         307.0       130.0    3504          12.0    70
1  15.0          8         350.0       165.0    3693          11.5    70
2  18.0          8         318.0       150.0    3436          11.0    70
3  16.0          8         304.0       150.0    3433          12.0    70
4  17.0          8         302.0       140.0    3449          10.5    70

  origin                       name
0    usa  chevrolet chevelle malibu
1    usa          buick skylark 320
2    usa         plymouth satellite
3    usa              amc rebel sst
4    usa                ford torino  >

In [132]:
df2 = df.drop(columns=['mpg','year'])
df2

,cylinders,displacement,horsepower,weight,acceleration,origin,name
0,8,307.0,130.0,3504,12.0,usa,chevrolet chevelle malibu
1,8,350.0,165.0,3693,11.5,usa,buick skylark 320
2,8,318.0,150.0,3436,11.0,usa,plymouth satellite
3,8,304.0,150.0,3433,12.0,usa,amc rebel sst
4,8,302.0,140.0,3449,10.5,usa,ford torino

In [134]:
df3 = df.drop(columns=['mpg','year','name'])
df3

   cylinders  displacement  horsepower  weight  acceleration origin
0          8         307.0       130.0    3504          12.0    usa
1          8         350.0       165.0    3693          11.5    usa
2          8         318.0       150.0    3436          11.0    usa
3          8         304.0       150.0    3433          12.0    usa
4          8         302.0       140.0    3449          10.5    usa

깔끔한 데이터 만들기Melt, Pivot

In [136]:
df = pd.DataFrame({'A' : {0 : 'a', 1 : 'b', 2 : 'c'},
                    'B' : {0:1, 1:3,2:5},
                    'C' : {0:2,1:4,2:6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [137]:
pd.melt(df, id_vars=['A'], value_vars=['B','C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [138]:
df2 = pd.melt(df, id_vars=['A'], value_vars=['B','C'])

In [139]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [140]:
df3 = pd.melt(df, value_vars=['A','B','C'])
df3

  variable value
0        A     a
1        A     b
2        A     c
3        B     1
4        B     3
5        B     5
6        C     2
7        C     4
8        C     6

In [141]:
df3 = pd.melt(df, value_vars=['A','B','C']).rename(columns={'variable':'var',
                                                            'value':'var'})
df3

  var var
0   A   a
1   A   b
2   A   c
3   B   1
4   B   3
5   B   5
6   C   2
7   C   4
8   C   6

In [142]:
# df.pivot 행의값을 열의 값으로 변경

In [143]:
df4 = pd.DataFrame({'bar' : ['A','B','C','A','B','C'],
                    'baz' : [1,2,3,4,5,6],
                    'foo' : ['one','one','one','two','two','two']})

df4

  bar  baz  foo
0   A    1  one
1   B    2  one
2   C    3  one
3   A    4  two
4   B    5  two
5   C    6  two

In [145]:
df4.pivot(index='foo', columns='bar',values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [147]:
df5 = df4.pivot(index='foo', columns='bar',values='baz').reset_index()

In [149]:
df5.melt(id_vars=['foo'], value_vars=['A','B','C'])

   foo bar  value
0  one   A      1
1  two   A      4
2  one   B      2
3  two   B      5
4  one   C      3
5  two   C      6

In [152]:
df5.melt(id_vars=['foo'], value_vars=['A','B','C']).sort_values(by=['foo','bar'])

   foo bar  value
0  one   A      1
2  one   B      2
4  one   C      3
1  two   A      4
3  two   B      5
5  two   C      6

In [154]:
#열값 변경
df5.melt(id_vars=['foo'], value_vars=['A','B','C']).sort_values(by=['foo','bar']).rename(columns={'value' : 'baz'})

   foo bar  baz
0  one   A    1
2  one   B    2
4  one   C    3
1  two   A    4
3  two   B    5
5  two   C    6

18. 데이터 합치기

In [155]:
import pandas as pd 

s1 = pd.Series(['a','b'])
s1

0    a
1    b
dtype: object

In [157]:
s2 = pd.Series(['c','d'])
s2

0    c
1    d
dtype: object

In [159]:
pd.concat([s1,s2], keys=['s1','s2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [160]:
pd.concat([s1,s2], keys=['s1','s2'], names=['Series name', 'Row id'])

Series name  Row id
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [161]:
df1 = pd.DataFrame([['a', 1], ['b',2]],
                    columns=['letter','number'])
df1

  letter  number
0      a       1
1      b       2

In [162]:
df2 = pd.DataFrame([['c', 3], ['d',4]],
                    columns=['letter','number'])
df2

  letter  number
0      c       3
1      d       4

In [166]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [167]:
df3 = pd.DataFrame([['c', 3,'cat'], ['d',4,'dog']],
                    columns=['letter','number','animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [168]:
pd.concat([df1,df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [169]:
pd.concat([df1,df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [170]:
df4 = pd.DataFrame([['bird','polly'], ['monkey','george']],
                    columns= ['animal','name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [173]:
df5 = pd.DataFrame([1], index=['a'])
df6 = pd.DataFrame([2], index=['a'])

In [175]:
# pd.concat([df5,df6], verify_integrity=True)
#ValueError: Indexes have overlapping values: Index(['a'], dtype='object')

19.  Merge로 데이터프레임 합치기

In [176]:
import pandas as pd 

adf = pd.DataFrame({'x1' : ['A','B','C'], 'x2' : [1,2,3]})
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [177]:
bdf = pd.DataFrame({'x1' : ['A','B','D'], 'x3' : ['T','F','T']})
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [178]:
pd.merge(adf, bdf, how='left', on = 'x1')

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [179]:
pd.merge(adf, bdf, how='right', on = 'x1')

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [180]:
pd.merge(adf, bdf, how='inner', on = 'x1') #둘다 있는 값만

  x1  x2 x3
0  A   1  T
1  B   2  F

In [181]:
pd.merge(adf, bdf, how='outer', on = 'x1') #모든 값 병합

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

In [182]:
adf.x1

0    A
1    B
2    C
Name: x1, dtype: object

In [184]:
bdf.x1

0    A
1    B
2    D
Name: x1, dtype: object

In [185]:
adf.x1.isin(bdf.x1)

0     True
1     True
2    False
Name: x1, dtype: bool

In [186]:
adf[adf.x1.isin(bdf.x1)] #둘다 있는 값 A,B

  x1  x2
0  A   1
1  B   2

In [187]:
adf[~adf.x1.isin(bdf.x1)]

  x1  x2
2  C   3

In [188]:
ydf = pd.DataFrame({'x1' : ['A','B','C'], 'x2' : [1,2,3]})
ydf

  x1  x2
0  A   1
1  B   2
2  C   3

In [189]:
zdf = pd.DataFrame({'x1' : ['B','C','D'], 'x2' : [2,3,4]})
zdf

  x1  x2
0  B   2
1  C   3
2  D   4

In [190]:
pd.merge(ydf,zdf) #디폴트 inner

  x1  x2
0  B   2
1  C   3

In [192]:
pd.merge(ydf,zdf, how='outer',indicator=True)

  x1  x2      _merge
0  A   1   left_only
1  B   2        both
2  C   3        both
3  D   4  right_only

In [193]:
pd.merge(ydf,zdf, how='outer',indicator=True).query('_merge == "left_only"')

  x1  x2     _merge
0  A   1  left_only

In [194]:
pd.merge(ydf,zdf, how='outer',indicator=True).query('_merge == "left_only"').drop(columns=['_merge'])

  x1  x2
0  A   1

20. SQL문 활용 데이터 집계<br>
df.groupy / shift()

In [196]:
df = sns.load_dataset('mpg')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [197]:
df.groupby(by='origin').size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [198]:
df.groupby(by='origin')

In [199]:
df['origin'].value_counts()

origin
usa       249
japan      79
europe     70
Name: count, dtype: int64

In [200]:
df.groupby(by='origin').min()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,16.2,4,68.0,46.0,1825,12.2,70,audi 100 ls
japan,18.0,3,70.0,52.0,1613,11.4,70,datsun 1200
usa,9.0,4,85.0,52.0,1800,8.0,70,amc ambassador brougham

In [201]:
df.groupby(by='origin').max()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,44.3,6,183.0,133.0,3820,24.8,82,vw rabbit custom
japan,46.6,6,168.0,132.0,2930,21.0,82,toyouta corona mark ii (sw)
usa,39.0,8,455.0,230.0,5140,22.2,82,pontiac ventura sj

In [208]:
df.groupby(by='origin')['cylinders'].median()

origin
europe    4.0
japan     4.0
usa       6.0
Name: cylinders, dtype: float64

In [210]:
pd.DataFrame(df.groupby(['model_year','origin'])['cylinders'].mean())

                   cylinders
model_year origin
70         europe   4.000000
           japan    4.000000
           usa      7.636364
71         europe   4.000000
           japan    4.000000
           usa      6.200000
72         europe   4.000000
           japan    3.800000
           usa      6.888889
73         europe   4.000000
           japan    4.250000
           usa      7.241379
74         europe   4.000000
           japan    4.000000
           usa      6.266667
75         europe   4.000000
           japan    4.000000
           usa      6.400000
76         europe   4.250000
           japan    4.500000
           usa      6.363636
77         europe   4.000000
           japan    4.166667
           usa      6.222222
78         europe   4.833333
           japan    4.000000
           usa      6.000000
79         europe   4.250000
           japan    4.000000
           usa      6.260870
80         europe   4.111111
           japan    4.076923
           usa      4.285714
81         europe   4.500000
           japan    4.333333
           usa      4.923077
82         europe   4.000000
           japan    4.000000
           usa      4.300000

In [212]:
df2 = pd.DataFrame(
    [[4,7,10],
     [5,11,8],
     [6,9,12]],
     index=[1,2,3],
     columns=['a','b','c']
)

In [220]:
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [217]:
print(df2.shift(1)) #행 아래 방향으로 1 칸씩 
print(df2.shift(-1))

     a     b     c
1  NaN   NaN   NaN
2  4.0   7.0  10.0
3  5.0  11.0   8.0
     a     b     c
1  5.0  11.0   8.0
2  6.0   9.0  12.0
3  NaN   NaN   NaN

In [218]:
df2['b'].shift(-1) #열방향

1    11.0
2     9.0
3     NaN
Name: b, dtype: float64

In [219]:
df2['b'].shift(2)

1    NaN
2    NaN
3    7.0
Name: b, dtype: float64

In [222]:
#rank 
df['model_year'].rank(method='max')

0       29.0
1       29.0
2       29.0
3       29.0
4       29.0
       ...
393    398.0
394    398.0
395    398.0
396    398.0
397    398.0
Name: model_year, Length: 398, dtype: float64

In [224]:
df['model_year'].rank(pct = True)  #비율이 어느정도인지

0      0.037688
1      0.037688
2      0.037688
3      0.037688
4      0.037688
         ...
393    0.962312
394    0.962312
395    0.962312
396    0.962312
397    0.962312
Name: model_year, Length: 398, dtype: float64

In [226]:
df['model_year'].rank(method='first').head()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: model_year, dtype: float64

In [227]:
#누적합
df2.cumsum()

    a   b   c
1   4   7  10
2   9  18  18
3  15  27  30

In [228]:
#누적최대값
df2.cummax()

   a   b   c
1  4   7  10
2  5  11  10
3  6  11  12

In [229]:
df2.cumprod() #누적 곱

     a    b    c
1    4    7   10
2   20   77   80
3  120  693  960